// SPDX-License-Identifier: GPL-3.0-only
/**
 * @file test_srcql.cpp
 *
 * @copyright Copyright (C) 2013-2024 srcML, LLC. (www.srcML.org)
 *
 *
 * Test cases for srcml_append_transform_srcql*()
*/

#include <srcml.h>

#include <iostream>
#include <string>
#include <vector>

#if defined(__GNUC__) && !defined(__MINGW32__)
#include <unistd.h>
#else
#include <io.h>
#endif
#include <fcntl.h>

#include <dassert.hpp>

int main(int, char* argv[]) {

    const std::string int_x_decl_srcml = 
        R"(<decl><type><name>int</name></type> <name>x</name></decl>)";

    const std::string int_x_decl_stmt_srcml = 
        R"(<decl_stmt><decl><type><name>int</name></type> <name>x</name></decl>;</decl_stmt>)";

    const std::string include_iostream_srcml = 
        R"(<cpp:include>#<cpp:directive>include</cpp:directive> <cpp:file>&lt;iostream&gt;</cpp:file></cpp:include>)";

    const std::string include_string_srcml = 
        R"(<cpp:include>#<cpp:directive>include</cpp:directive> <cpp:file>&lt;string&gt;</cpp:file></cpp:include>)";

    const std::string int_x_decl_statement_src = R"(
int x;
)";

    const std::string int_x_function_decl_statement_src = R"(
void foo() {
    int x;
}
)";

    const std::string int_x_parameter_src = R"(
void foo(int x) {}
)";

    const std::string include_iostream_src = R"(
#include <iostream>
)";

    const std::string include_string_src = R"(
#include <string>
)";

    ////// Raw Source Code Expressions

    //// srcML Tags
    // src:decl
    {

        dassert(srcml_append_transform_srcql(iarchive,"$T $N"), SRCML_STATUS_OK);

        unit = srcml_archive_read_unit(iarchive);
        srcml_transform_result* result = nullptr;
        srcml_unit_apply_transforms(iarchive, unit, &result);

        dassert(srcml_transform_get_type(result), SRCML_RESULT_UNITS);
        dassert(srcml_transform_get_unit_size(result), 3);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,0)), int_y_decl_srcml);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,1)), int_y_decl_srcml);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,2)), int_y_decl_srcml);

        srcml_unit_free(unit);
        srcml_transform_free(result);
        srcml_archive_close(iarchive);
        srcml_archive_free(iarchive);
    }

    {
        char* s;
        size_t size;

        srcml_archive* oarchive = srcml_archive_create();
        srcml_archive_write_open_memory(oarchive,&s, &size);

        srcml_unit* unit = srcml_unit_create(oarchive);
        srcml_unit_set_language(unit,"C++");
        std::string input = int_x_decl_statement_src + int_y_decl_statement_src + int_x_function_decl_statement_src + int_y_function_decl_statement_src + int_x_parameter_src + int_y_parameter_src;
        srcml_unit_parse_memory(unit,input.c_str(),input.size());
        dassert(srcml_archive_write_unit(oarchive,unit), SRCML_STATUS_OK);

        srcml_unit_free(unit);
        srcml_archive_close(oarchive);
        srcml_archive_free(oarchive);

        std::string srcml_text = std::string(s, size);
        free(s);

        srcml_archive* iarchive = srcml_archive_create();
        srcml_archive_read_open_memory(iarchive,srcml_text.c_str(),srcml_text.size());
        dassert(srcml_append_transform_srcql(iarchive,"$T $N"), SRCML_STATUS_OK);

        unit = srcml_archive_read_unit(iarchive);
        srcml_transform_result* result = nullptr;
        srcml_unit_apply_transforms(iarchive, unit, &result);

        dassert(srcml_transform_get_type(result), SRCML_RESULT_UNITS);
        dassert(srcml_transform_get_unit_size(result), 6);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,0)), int_x_decl_srcml);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,1)), int_y_decl_srcml);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,2)), int_x_decl_srcml);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,3)), int_y_decl_srcml);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,4)), int_x_decl_srcml);
        dassert(srcml_unit_get_srcml_inner(srcml_transform_get_unit(result,5)), int_y_decl_srcml);

        srcml_unit_free(unit);
        srcml_transform_free(result);
        srcml_archive_close(iarchive);
        srcml_archive_free(iarchive);
    }

    const std::string list_of_exprs = R"(
/*0*/   1;
/*1*/   2;
/*2*/   x;
/*3*/   y;
/*4*/   z;
/*5*/   1 + 1;
/*6*/   1 + 2;
/*7*/   2 + 1;
/*8*/   x + x;
/*9*/   x + y;
/*10*/  x + z;
/*11*/  y + x;
/*12*/  y + y;
/*13*/  y + z;
/*14*/  z + x;
/*15*/  z + y;
/*16*/  z + z;
/*17*/  x + x + x;
/*18*/  x + x + y;
/*19*/  x + x + z;
/*20*/  x + y + x;
/*21*/  x + y + y;
/*22*/  x + y + z;
/*23*/  x + z + x;
/*24*/  x + z + y;
/*25*/  x + z + z;
/*26*/  y + x + x;
/*27*/  y + x + y;
/*28*/  y + x + z;
/*29*/  y + y + x;
/*30*/  y + y + y;
/*31*/  y + y + z;
/*32*/  y + z + x;
/*33*/  y + z + y;
/*34*/  y + z + z;
/*35*/  z + x + x;
/*36*/  z + x + y;
/*37*/  z + x + z;
/*38*/  z + y + x;
/*39*/  z + y + y;
/*40*/  z + y + z;
/*41*/  z + z + x;
/*42*/  z + z + y;
/*43*/  z + z + z;
)";

    const std::vector<std::string> exprs_srcml {
/*0*/   R"(<expr><literal type="number">1</literal></expr>)",
/*1*/   R"(<expr><literal type="number">2</literal></expr>)",
/*2*/   R"(<expr><name>x</name></expr>)",
/*3*/   R"(<expr><name>y</name></expr>)",
/*4*/   R"(<expr><name>z</name></expr>)",
/*5*/   R"(<expr><literal type="number">1</literal> <operator>+</operator> <literal type="number">1</literal></expr>)",
/*6*/   R"(<expr><literal type="number">1</literal> <operator>+</operator> <literal type="number">2</literal></expr>)",
/*7*/   R"(<expr><literal type="number">2</literal> <operator>+</operator> <literal type="number">1</literal></expr>)",
/*8*/   R"(<expr><name>x</name> <operator>+</operator> <name>x</name></expr>)",
/*9*/   R"(<expr><name>x</name> <operator>+</operator> <name>y</name></expr>)",
/*10*/  R"(<expr><name>x</name> <operator>+</operator> <name>z</name></expr>)",
